{
  "products": [
    {
      "id": 1,
      "picture": "https://www.notik.ru/img/catalog_img/84735/big/1_dellvostro54025402-6060.jpg",
      "title": "Dell Vostro",
      "price": 61000,
      "inStock": 2,
      "fullDescription": "Dell Vostro 5402 снабжен 14-дюймовым экраном, мощным процессором Intel Core i5 1135G7 (Tiger Lake) 2.4 ГГц, хорошей видеокартой NVIDIA GeForce® MX330. Модель Vostro 5402 привлекательна для покупателей, часто пользующихся ноутбуком как в помещении, так и вне его. Ноутбуки Dell Vostro 5402 популярны среди покупателей благодаря широкому выбору конфигураций, приемлемой цене и первоклассному качеству ноутбуков."
    },
    {
      "id": 2,
      "picture": "https://www.notik.ru/img/catalog_img/74961/retinaorig/1_asusvivobookx512jpbq006t.jpg",
      "title": "ASUS VivoBook 15",
      "price": 59600,
      "inStock": 20,
      "fullDescription": "ASUS VivoBook X512JP оборудован качественным 15.6-дюймовым экраном, оптимальным процессором Intel Core i5 1035G1 (Ice Lake) 1 ГГц, производительную видеокарту NVIDIA GeForce® MX330. Модель VivoBook X512JP привлекательна для покупателей, часто пользующихся ноутбуком как в помещении, так и в поездках. Ноутбуки ASUS пользуются отличным спросом благодаря приемлемой цене, отличной клавиатуре и облегченному корпусу."
    },
    {
      "id": 3,
      "picture": "https://www.notik.ru/img/catalog_img/84347/retinaorig/1_hppavilion15-egeg0127ur.jpg",
      "title": "HP Pavilion 15",
      "price": 74600,
      "inStock": 2,
      "fullDescription": "HP 15-eg оснащен 15.6-дюймовым экраном, производительным процессором Intel Core i5 1135G7 (Tiger Lake) 2.4 ГГц, имеет небольшой вес, хорошую видеокарту NVIDIA GeForce® MX350. Модель 15-eg популярна среди покупателей, часто пользующихся ноутбуком как в помещении, так и вне его. Ноутбуки HP 15-eg интересны для пользователей благодаря большому выбору конфигураций, невысокой цене и превосходному качеству продукции."
    },
    {
      "id": 4,
      "picture": "https://www.notik.ru/img/catalog_img/83055/retinaorig/1_msimodernmodern_15a11sbu-476ru.jpg",
      "title": "MSI Modern 15",
      "price": 88500,
      "inStock": 10,
      "fullDescription": "Ноутбук MSI Modern 15 оснащен ярким 15.6-дюймовым экраном, современным процессором Intel Core i7 1165G7 (Tiger Lake) 2.8 ГГц, имеет надежную систему охлаждения, мультимедийную видеокарту NVIDIA GeForce® MX450. Модель MSI Modern 15 популярна среди пользователей и обладает прочным и самым легким корпусом в линейке MSI. Ноутбуки MSI Modern 15 привлекательны для покупателей благодаря большому выбору конфигураций, исключительному качеству товаров и приемлемой цене."
    },
    {
      "id": 5,
      "picture": "https://www.notik.ru/img/catalog_img/81760/retinaorig/1_applemacbook_airmacbook_air_m1_2020z12a0008q.jpg",
      "title": "Apple MacBook Air",
      "price": 112900,
      "inStock": 3,
      "fullDescription": "Ноутбук Apple MacBook Air M1 2020 оборудован ярким 13.3-дюймовым экраном, мощным процессором Apple M1 M1 3.2 ГГц, имеет хорошую видеокарту Apple 7-core Graphics. Модель MacBook Air MacBook Air M1 2020 популярна среди покупателей, часто пользующихся ноутбуком как на работе, так и на отдыхе. Ноутбуки Apple зарекомендовали себя благодаря разнообразию выбора конфигураций, цветов и прочному корпусу."
    },
    {
      "id": 6,
      "picture": "https://www.notik.ru/img/catalog_img/80725/retinaorig/1_hp14s14s-dqdq0046ur.jpg",
      "title": "HP 14s",
      "price": 28700,
      "inStock": 16,
      "fullDescription": "HP 14s-dq снабжен 14-дюймовым экраном, мощным процессором Intel Pentium Quad Core N5030 (Gemini Lake R) 1.1 ГГц, имеет небольшой вес, хорошую видеокарту Intel UHD Graphics 605. Модель 14s-dq привлекательна для покупателей, часто пользующихся ноутбуком как в помещении, так и вне его. Ноутбуки HP 14s-dq знамениты среди пользователей благодаря широкому выбору конфигураций, невысокой цене и первоклассному качеству техники."
    },
    {
      "id": 7,
      "picture": "https://www.notik.ru/img/catalog_img/84459/retinaorig/1_irbisnbnb253nb253.jpg",
      "title": "IRBIS NB253",
      "price": 21800,
      "inStock": 5,
      "fullDescription": "IRBIS NB253 оснащен 15.6-дюймовым экраном, современным процессором Intel Pentium Quad Core J3710 (Braswell) 1600 ГГц, обладает отличной эргономикой. Модель NB253 привлекательна для покупателей, часто пользующихся ноутбуком как в помещении, так и вне его. Ноутбуки IRBIS популярны среди покупателей благодаря разнообразию выбора конфигураций, приемлемой цене и превосходному качеству продукции."
    },
    {
      "id": 8,
      "picture": "https://www.notik.ru/img/catalog_img/78980/retinaorig/1_hpspectrex360aw2024ur.jpg",
      "title": "HP Spectre x360",
      "price": 110500,
      "inStock": 11,
      "fullDescription": "Ноутбук HP Spectre x360 оборудован ярким 13.3-дюймовым экраном, мощным процессором Intel Core i5 1135G7 (Tiger Lake) 2.4 ГГц, имеет мультимедийную видеокарту Intel Iris Xe Graphics. Модель Spectre x360 привлекательна для покупателей, часто пользующихся ноутбуком как на отдыхе, так и в офисе. Ноутбуки HP Spectre x360 зарекомендовали себя благодаря широкому выбору цветов, превосходному корпусу и богатой комплектацией."
    },
    {
      "id": 9,
      "picture": "https://www.notik.ru/img/catalog_img/80156/retinaorig/1_lenovothinkbook14s_yoga_itl20we0030ru.jpg",
      "title": "Lenovo ThinkBook 14s",
      "price": 68900,
      "inStock": 3,
      "fullDescription": "Lenovo ThinkBook 14s Yoga оборудован 14-дюймовым экраном и хорошей IPS (LED) матрицей, производительным процессором Intel Core i5 1135G7 (Tiger Lake) 2.4 ГГц, производительной видеокартой Intel Iris Xe Graphics. Модель ThinkBook 14s Yoga популярна среди покупателей, часто пользующихся ноутбуком как в поездках, так и на работе."
    },
    {
      "id": 10,
      "picture": "https://www.notik.ru/img/catalog_img/84066/retinaorig/1_msicreatorcreator_17b11uh-416ru.jpg",
      "title": "MSI Creator 17",
      "price": 329000,
      "inStock": 8,
      "fullDescription": "Ноутбук MSI Creator 17 снабжен сочным 17.3-дюймовым экраном, производительным процессором Intel Core i9 11900H (Tiger Lake) 2.5 ГГц, имеет великолепную систему охлаждения, игровую видеокарту NVIDIA GeForce® RTX 3080 для ноутбуков. Модель MSI Creator 17 интересна для пользователей как часто играющих за ноутбуком, так и работающих с тяжелыми приложениями и обладает облегченным корпусом. Игровые ноутбуки MSI Creator 17 привлекательны для покупателей благодаря большому выбору конфигураций, превосходному качеству продукции и приемлемой цене."
    }
  ],
  "userData": [
    {
      "login": "admin",
      "password": "admin",
      "role": "admin"
    },
    {
      "login": "customer",
      "password": "customer",
      "role": "customer"
    }
  ],
  "cart": [
    {
      "count": 0,
      "amount": 0,
      "id": 1
    }
  ]
}